---
kind: method
id: M:Autodesk.Revit.DB.STEPImportOptions.#ctor(Autodesk.Revit.DB.STEPImportOptions)
source: html/fdfdf248-763c-22b1-db7e-ac28a9266617.htm
---
# Autodesk.Revit.DB.STEPImportOptions.#ctor Method

Constructs a new instance of STEPImportOptions as a copy of the import options.

## Syntax (C#)
```csharp
public STEPImportOptions(
	STEPImportOptions option
)
```

## Parameters
- **option** (`Autodesk.Revit.DB.STEPImportOptions`) - The STEP options to be copied.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null